---
kind: type
id: T:Autodesk.Revit.DB.FamilyTypeSet
source: html/c38b1482-db14-7c2b-8efc-68a20bf35a24.htm
---
# Autodesk.Revit.DB.FamilyTypeSet

A set that contains FamilyType objects.

## Syntax (C#)
```csharp
public class FamilyTypeSet : APIObject,
	IEnumerable
```